{
  "home": {
    "experience": "Experience",
    "projects": "Projects",
    "skills": "Skills",
    "blog": "Blog",
    "change_language": "Change Language",
    "footer_text": "Made with Flutter ❤️ \nby Maxim Bulanovich | Flutter Developer",
    "open_linkedin": "Open LinkedIn",
    "open_github": "Open GitHub",
    "message_telegram": "Message on Telegram",
    "follow_instagram": "Follow on Instagram"
  },
  "about": {
    "name": "Max Bulanovich",
    "role": "Flutter Developer",
    "descr_first": "Flutter Developer | Crafting Engaging and High-Performance Mobile Applications | Eager to Learn, Adapt, and Drive Innovation",
    "descr_second": "In addition to App Development, I collaborate with experienced specialists to create Websites, Telegram Bots, and Graphic Design to bring your ideas to life. Feel free to contact me for website creation, UI/UX design, Telegram bots, and more.",
    "about_me": "About Me",
    "get_in_touch": "Get in Touch",
    "statistics": "Statistics",
    "years_experience": "+ years of experience",
    "hours_coding": "+ hours of coding",
    "cups": "+ coups of tea",
    "projects": "+ commercial projects"
  },
  "actually": "Actually",
  "freelance": "Freelance",
  "adaptine_descr": "Developing Mobile and Web applications",
  "freelance_descr": "Creating cross-platform iOS, Android ans Web Apps with a focus on innovation.",
  "projects": {
    "gross_radar_tms": {
      "name": "Gross Radar TMS",
      "description": "I developed a Transportation Management System (TMS) from scratch to work with the GrossRadar mobile app, enabling the creation and management of loads for app users. I built features to create organizations, invite users from the app, and manage trips efficiently. I implemented tools for creating, assigning, and tracking trips, as well as monitoring trip progress and history. The system integrates seamlessly with the mobile app, supporting real-time updates and smooth workflow for drivers and dispatchers."
    },
    "gross_radar_mobile": {
      "name": "Gross Radar Mobile",
      "description": "I continued development of the GrossRadar Mobile App, focusing on bug fixes and improving existing features. I worked with Google Maps to implement optimized routing methods that prevent mixing pickups and drop-offs for each load. I enhanced real-time load tracking, expense management, and driver payroll features while keeping the interface user-friendly. I ensured seamless performance and reliable data synchronization across iOS and Android platforms."
    },
    "portfolio": {
      "name": "THIS PORTFOLIO",
      "description": "I created this portfolio to showcase my skills and projects. It is a Flutter web application."
    },
    "maru": {
      "name": "Maru",
      "description": "Maru was developed to create a secure and decentralized way to access the internet that is resistant to censorship and ensures a high level of anonymity. The network consists of numerous nodes created by users around the world, making it decentralized and resilient to attacks."
    },
    "papi_burgers": {
      "name": "Papi Burgers",
      "description": "This application functions as a delivery platform for a network of restaurants, offering users an intuitive way to order food. At the start, users select their preferred restaurant, add desired items to their cart, and proceed seamlessly to checkout, with integrated payment options for a smooth transaction process. In addition, a powerful Admin application provides full control over the platform's operations. Administrators can easily manage restaurants, edit or add menus, update restaurant locations on the map, post job vacancies, and perform various other administrative tasks to ensure smooth platform management."
    },
    "nullend_vpn": {
      "name": "NullEnd VPN",
      "description": "NULL END® is an application that combines VPN and Tor technologies to provide robust digital security. VPN encrypts your traffic and hides your IP address, while Tor enables anonymous internet browsing through a secure network of servers. Together, they ensure protection against tracking and data leaks, making NULL END® a new standard in internet security. The app includes two VPN protocols and flexible Tor settings to bypass blocks, encrypting all device traffic for dependable protection. As the app's developer, I've implemented some small fixes to improve non-native components, enhancing its performance."
    },
    "nullend_browser": {
      "name": "NullEnd Browser",
      "description": "The application is a secure browser with an integrated VPN (NullEnd VPN) offering Standard and Incognito modes. In Incognito mode, browsing history, cookies, and cache are cleared, WebRTC is disabled, and downloads require confirmation to prevent accidental files or viruses. It supports tabbed browsing, bookmarks with editing, search history, and download tracking. Available in Russian and English."
    },
    "easy_pgp": {
      "name": "EasyPGP",
      "description": "The app decrypts PGP-encrypted messages using the password and the PGP private key. Decrypt messages by pasting the encrypted text or scanning a QR code. If you don't have PGP keys, generate them in the app with 2048, 4096, or 8192-bit lengths. Generated keys are securely stored on your phone. You can also upload existing key pairs. Access can be secured with a password, fingerprint, or Face ID."
    },
    "taxi_app": {
      "name": "Taxi App",
      "description": "The application's real name is kept confidential at the client's request. I was involved in developing the entire UI (layout), Google Maps integration and optimization."
    },
    "horizon_village": {
      "name": "Horizon Village",
      "description": "This app is designed for remote regions in Uzbekistan. Residents can use it to buy or sell items in the marketplace, receive news from local authorities, view promotional posts, find a ride to the city, or offer rides to others."
    },
    "kami": {
      "name": "Kami",
      "description": "The KAMI app, soon to be rebranded as APAR, was created for the eco-friendly electric truck manufacturer to streamline freight transportation. Users can order transport by selecting up to 3 delivery points on a map, view all orders, and access detailed route and order information directly in the app."
    },
    "budget_manager": {
      "name": "Budget Manager",
      "description": "My first Flutter app! It helps you track your expenses and income and is available in four languages. I designed every aspect of the app except for the graphical representation of expense/income filtering by month and local currency storage functionality."
    }
  },
  "about_me": "My name is Max Bulanovich, and I’m a Flutter developer. My journey into programming didn’t start in a typical way.\n\nAt first, I wasn’t interested in coding at all — I had no idea how apps were built and didn’t even try to learn. But I’ve always been curious about how things work: how a camera captures an image, why a car moves, how sound comes through headphones.\n\nEverything changed on September 14, 2022, when I randomly came across a TikTok video: a timelapse of someone building an app with Flutter, and the result instantly appeared on the phone emulator. That moment struck me. I didn’t understand what I was seeing, but I was fascinated by how code could turn ideas into a visual result right away.\n\nI dove into the comments, where people mentioned words like framework, cross-platform, Dart, Flutter… all of it was new to me. I started googling, and the very same day I found a YouTube tutorial where someone built a simple ToDo app with Flutter and Firebase. I didn’t just watch it — I immediately started coding along.\n\nThat day I spent around 10 hours learning, and by the end, I was already building my first app. That app became Budget Manager, which I worked on from October to December 2022 and eventually published on Google Play.\n\nFrom the start, I had countless questions and spent hours every day learning. It wasn’t a burden — it was incredibly exciting. I’ve always loved exploring new technologies and experimenting with fresh ideas, and Flutter opened a whole new world for me.\n\nIn May 2023, I received my first freelance offer. Together with a colleague, we built a real-world app. That was the moment I realized: I’m creating something people will actually use. It motivated me even more. Since then, not a single day has passed without me working on a project — whether it’s a startup, a freelance app, or one of my own ideas.\n\nBut I don’t take every project. For me, it’s important to create apps that are useful, meaningful, and built with passion. That’s why I don’t work on clones, gambling apps, phishing projects, or anything harmful.\n\nIf you have an idea that can make people’s lives easier, better, or more inspiring, let’s talk! I’d love to discuss your project and see how we can bring it to life."
}
