{
  "home": {
    "experience": "Опыт",
    "projects": "Проекты",
    "skills": "Знания",
    "blog": "Блог",
    "change_language": "Изменить язык",
    "footer_text": "Создано на Flutter ❤️ \n Макс Буланович | Flutter разработчик",
    "open_linkedin": "Открыть LinkedIn",
    "open_github": "Открыть GitHub",
    "message_telegram": "Написать в Telegram",
    "follow_instagram": "Подписаться в Instagram"
  },
  "about": {
    "name": "Макс Буланович",
    "role": "Flutter Разработчик",
    "descr_first": "Flutter Разработчик | Создаю увлекательные и высокопроизводительные мобильные приложения | Стремлюсь учиться, адаптироваться и внедрять инновации",
    "descr_second": "Помимо разработки приложений, я сотрудничаю с опытными специалистами для создания веб-сайтов, Telegram-ботов и графического дизайна, чтобы воплотить ваши идеи в жизнь. Свяжитесь со мной для создания сайтов, UI/UX дизайна, Telegram-ботов и другого.",
    "about_me": "Обо мне",
    "get_in_touch": "Связаться",
    "statistics": "Статистика",
    "years_experience": "+ лет опыта",
    "hours_coding": "+ часов кодинга",
    "cups": "+ чашек чая",
    "projects": "+ коммерческих проектов"
  },
  "actually": "Сейчас",
  "freelance": "Фриланс",
  "adaptine_descr": "Разработка мобильных и веб-приложений",
  "freelance_descr": "Создание кроссплатформенных приложений для iOS, Android и Web с акцентом на инновации.",
  "projects": {
    "gross_radar_tms": {
      "name": "Gross Radar TMS",
      "description": "Я разработал систему управления транспортом (TMS) с нуля для работы с мобильным приложением GrossRadar, обеспечивая создание и управление грузами для пользователей приложения. Я создал функции для создания организаций, приглашения пользователей из приложения и эффективного управления поездками. Я реализовал инструменты для создания, назначения и отслеживания поездок, а также мониторинга прогресса и истории поездок. Система бесшовно интегрируется с мобильным приложением, поддерживая обновления в реальном времени и плавный рабочий процесс для водителей и диспетчеров."
    },
    "gross_radar_mobile": {
      "name": "Gross Radar Mobile",
      "description": "Я продолжил разработку мобильного приложения GrossRadar, сосредоточившись на исправлении ошибок и улучшении существующих функций. Я работал с Google Maps для реализации оптимизированных методов маршрутизации, которые предотвращают смешивание пунктов погрузки и разгрузки для каждого груза. Я улучшил отслеживание грузов в реальном времени, управление расходами и функции расчета зарплаты водителей, сохраняя при этом удобный интерфейс. Я обеспечил бесперебойную работу и надежную синхронизацию данных на платформах iOS и Android."
    },
    "portfolio": {
      "name": "ЭТО ПОРТФОЛИО",
      "description": "Я создал это портфолио, чтобы продемонстрировать свои навыки и проекты. Это веб-приложение на Flutter."
    },
    "maru": {
      "name": "Maru",
      "description": "Maru был разработан для создания безопасного и децентрализованного способа доступа к интернету, устойчивого к цензуре и обеспечивающего высокий уровень анонимности. Сеть состоит из множества узлов, созданных пользователями по всему миру, что делает её децентрализованной и устойчивой к атакам."
    },
    "papi_burgers": {
      "name": "Papi Burgers",
      "description": "Это приложение функционирует как платформа доставки для сети ресторанов, предлагая пользователям интуитивный способ заказа еды. В начале пользователи выбирают предпочитаемый ресторан, добавляют желаемые блюда в корзину и плавно переходят к оформлению заказа с интегрированными вариантами оплаты для удобства транзакций. Кроме того, мощное административное приложение обеспечивает полный контроль над операциями платформы. Администраторы могут легко управлять ресторанами, редактировать или добавлять меню, обновлять местоположения ресторанов на карте, публиковать вакансии и выполнять различные другие административные задачи для обеспечения бесперебойной работы платформы."
    },
    "nullend_vpn": {
      "name": "NullEnd VPN",
      "description": "NULL END® - это приложение, которое сочетает технологии VPN и Tor для обеспечения надежной цифровой безопасности. VPN шифрует ваш трафик и скрывает ваш IP-адрес, в то время как Tor обеспечивает анонимный просмотр интернета через безопасную сеть серверов. Вместе они обеспечивают защиту от отслеживания и утечек данных, делая NULL END® новым стандартом в интернет-безопасности. Приложение включает два протокола VPN и гибкие настройки Tor для обхода блокировок, шифруя весь трафик устройства для надежной защиты. Как разработчик приложения, я внедрил некоторые небольшие исправления для улучшения нативных компонентов, повышая его производительность."
    },
    "nullend_browser": {
      "name": "NullEnd Browser",
      "description": "Приложение представляет собой безопасный браузер со встроенным VPN (NullEnd VPN), предлагающий стандартный и режим инкогнито. В режиме инкогнито очищается история просмотров, файлы cookie и кэш, отключается WebRTC, а загрузки требуют подтверждения для предотвращения случайных файлов или вирусов. Поддерживается просмотр во вкладках, закладки с редактированием, история поиска и отслеживание загрузок. Доступно на русском и английском языках."
    },
    "easy_pgp": {
      "name": "EasyPGP",
      "description": "Приложение расшифровывает PGP-зашифрованные сообщения, используя пароль и приватный ключ PGP. Расшифровывайте сообщения, вставляя зашифрованный текст или сканируя QR-код. Если у вас нет ключей PGP, создайте их в приложении с длиной 2048, 4096 или 8192 бит. Созданные ключи надежно хранятся на вашем телефоне. Вы также можете загрузить существующие пары ключей. Доступ может быть защищен паролем, отпечатком пальца или Face ID."
    },
    "taxi_app": {
      "name": "Taxi App",
      "description": "Реальное название приложения сохраняется в тайне по просьбе клиента. Я участвовал в разработке всего пользовательского интерфейса (верстка), интеграции и оптимизации Google Maps."
    },
    "horizon_village": {
      "name": "Horizon Village",
      "description": "Это приложение предназначено для отдаленных регионов Узбекистана. Жители могут использовать его для покупки или продажи товаров на рынке, получения новостей от местных властей, просмотра рекламных объявлений, поиска попутки в город или предложения подвоза другим."
    },
    "kami": {
      "name": "Kami",
      "description": "Приложение KAMI, которое скоро будет переименовано в APAR, было создано для производителя экологически чистых электрических грузовиков для оптимизации грузоперевозок. Пользователи могут заказать транспорт, выбрав до 3 точек доставки на карте, просмотреть все заказы и получить доступ к подробной информации о маршруте и заказе прямо в приложении."
    },
    "budget_manager": {
      "name": "Budget Manager",
      "description": "Мое первое приложение на Flutter! Оно помогает отслеживать ваши расходы и доходы и доступно на четырех языках. Я разработал каждый аспект приложения, за исключением графического представления фильтрации расходов/доходов по месяцам и функциональности хранения локальной валюты."
    }
  },
  "about_me": "Меня зовут Макс Буланович, и я Flutter-разработчик. Мой путь в программирование начался совсем не так, как у большинства.\n\nСначала меня программирование вообще не интересовало — я не понимал, как создаются приложения и даже не пытался разобраться. Но мне всегда было любопытно, как устроены вещи: как камера делает снимок, почему едет машина, как звук попадает в наушники.\n\nВсё изменилось 14 сентября 2022 года, когда я случайно наткнулся на видео в TikTok: таймлапс создания приложения на Flutter, и результат мгновенно появлялся на эмуляторе телефона. Этот момент меня поразил. Я не понимал, что именно происходит, но был поражён тем, как код прямо на глазах превращается в визуальный результат.\n\nЯ полез в комментарии, где увидел слова: фреймворк, кроссплатформенность, Dart, Flutter… Всё это было для меня новым. Я начал гуглить, и в тот же день нашёл урок на YouTube, в котором разработчик создавал простое ToDo-приложение на Flutter и Firebase. Я не просто посмотрел — я сразу начал повторять.\n\nВ тот день я учился около 10 часов, и к вечеру уже создавал своё первое приложение. Оно превратилось в Budget Manager — проект, над которым я работал с октября по декабрь 2022 года и затем опубликовал в Google Play.\n\nС самого начала у меня было бесконечно много вопросов, и я каждый день по многу часов учился. Но это не было в тягость — наоборот, это было невероятно увлекательно. Я всегда любил изучать новые технологии и экспериментировать с идеями, и Flutter открыл для меня целый новый мир.\n\nВ мае 2023 года я получил первое предложение по фрилансу. Вместе с коллегой мы сделали реальное рабочее приложение. Тогда я понял: я создаю что-то, чем люди действительно пользуются. Это дало огромную мотивацию. С тех пор не прошло ни дня, чтобы я не работал над каким-то проектом — это мог быть стартап, фриланс-заказ или моя личная идея.\n\nНо я беру не каждый проект. Для меня важно создавать приложения, которые полезны, значимы и сделаны с душой. Поэтому я не работаю над копиями, азартными приложениями, фишингом или чем-то вредным.\n\nЕсли у вас есть идея, которая может сделать жизнь людей проще, лучше или вдохновеннее — давайте поговорим! Буду рад обсудить ваш проект и помочь воплотить его в жизнь."
}
